app/controllers/categories_controller.rb

  def new
    @category = Category.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def edit
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @category = Category.new(category_params)
    respond_to do |format|
      if @category.save
        if params[:category][:tag_ids].present?
          tag_ids = params[:category][:tag_ids].reject(&:empty?)
          create_category_tag_records(tag_ids)
        end
        format.html { redirect_to @category, notice: 'Category was successfully created.' }
        format.json { render :show, status: :created, location: @category }
      else
        @tags = Tag.all
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "black and whitw"], ["description", "fghj"], ["created_at", "2020-11-07 18:12:19.888156"], ["updated_at", "2020-11-07 18:12:19.888156"]]
SELECT "tags".* FROM "tags"

    def create_category_tag_records(ids)
      old_ids = @category.category_tags.pluck(:tag_id)
      return if old_ids == ids

      remove_ids = old_ids -= ids
      ids -= old_ids
      ids.each do |id|
        @category.category_tags.create(tag_id: id)
      end
      @category.category_tags.where(tag_id: old_ids).destroy_all
---
SELECT "category_tags"."tag_id" FROM "category_tags" WHERE "category_tags"."category_id" = $1  [["category_id", 6]]
SELECT "category_tags".* FROM "category_tags" WHERE "category_tags"."category_id" = $1 AND 1=0  [["category_id", 6]]
INSERT INTO "category_tags" ("category_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 6], ["tag_id", 4], ["created_at", "2020-11-07 19:48:15.789894"], ["updated_at", "2020-11-07 19:48:15.789894"]]
DELETE FROM "category_tags" WHERE "category_tags"."id" = $1  [["id", 5]]
SELECT "category_tags".* FROM "category_tags" WHERE "category_tags"."category_id" = $1 AND "category_tags"."tag_id" IN ($2, $3)  [["category_id", 6], ["tag_id", 4], ["tag_id", 5]]