app/controllers/products_controller.rb

  def new
    @product = Product.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def edit
    tags = @product.tags
    @tags = Tag.where.not(id: tags.pluck(:id))
    @show_available_tags = tags.count != Tag.all.count
---
SELECT "tags"."id" FROM "tags" INNER JOIN "product_tags" ON "tags"."id" = "product_tags"."tag_id" WHERE "product_tags"."product_id" = $1  [["product_id", 3]]
SELECT COUNT(*) FROM "tags" INNER JOIN "product_tags" ON "tags"."id" = "product_tags"."tag_id" WHERE "product_tags"."product_id" = $1  [["product_id", 3]]

  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save
        if params[:product][:tag_ids].present?
          tag_ids = params[:product][:tag_ids].reject(&:empty?)
          create_product_tag_records(tag_ids)
        end
        format.html { redirect_to @product, notice: 'Product was successfully created.' }
        format.json { render :show, status: :created, location: @product }
      else
        tags = @product.tags
        @tags = Tag.where.not(id: tags.pluck(:id))
        @show_available_tags = tags.count != Tag.all.count
---
INSERT INTO "products" ("name", "description", "brand", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Shirt"], ["description", "fghj"], ["brand", "ghj"], ["price", "11.0"], ["created_at", "2020-11-07 15:20:10.758790"], ["updated_at", "2020-11-07 15:20:10.758790"]]
SELECT COUNT(*) FROM "tags"

    def create_product_tag_records(ids)
      ids.each do |id|
        @product.product_tags.create(tag_id: id)
---
INSERT INTO "product_tags" ("product_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 3], ["tag_id", 1], ["created_at", "2020-11-07 18:00:26.785281"], ["updated_at", "2020-11-07 18:00:26.785281"]]