app/controllers/tags_controller.rb

UPDATE "tags" SET "description" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["description", "hhhhhhhhh"], ["updated_at", "2020-11-07 17:10:31.355150"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tag.update(tag_params)